Code/CoursesExampleSolution/solutionNotes.org
#+TITLE: Courses In Class Refactoring Solution
#+AUTHOR: Buffalo
#+EMAIL: hewner@rose-hulman.edu
#+OPTIONS: ^:{}
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:t tex:t
#+INFOJS_OPT:t
#+DRAWERS: INSTRUCTOR


* Step 1: Playing with a function

I start out without any strong intuition about what I want to do,
except a feeling that there is a strong similarity between all the
functions that use a database.  There are similarity between classes
too, but I'm not 100% sure what to make of that so I decide to start
in the simplest possible way.

I look at the function Course::create and decide to pull out the
database specific code, hoping that maybe I can reuse that in some of
the other functions:

#+BEGIN_SRC java
public static Course create(String name, int credits) 
    throws Exception 
{
  Connection conn = null;

  try {
      conn = DriverManager.getConnection(url, "", "");
      Statement statement = conn.createStatement();
      statement.executeUpdate(
    	"DELETE FROM course WHERE name = '" + name + "'");
      statement.executeUpdate(
    	"INSERT INTO course VALUES ('" + name 
    	+ "', " + credits + ")");
      return new Course(name, credits);
  } finally {
      try { conn.close(); } catch (Exception ignored) {}
  }
}
#+END_SRC

It takes me a minute to figure out what I want to do with the 2
different SQL commands.  I decide on making my new function take an
array of Strings.

#+BEGIN_SRC java
public static void doDBCommands(String[] commands) throws Exception {
	Connection conn = null;

	try {
		conn = DriverManager.getConnection(url, "", "");
		Statement statement = conn.createStatement();
		for (String command : commands) {
			statement.executeUpdate(command);
		}
	} finally {
		try {
			conn.close();
		} catch (Exception ignored) {
		}
	}
}

public static Course create(String name, int credits) throws Exception {

	String[] commands = { 
			"DELETE FROM course WHERE name = '" + name + "'",
			"INSERT INTO course VALUES ('" + name + "', " + credits + ")" 
			};
	doDBCommands(commands);
	return new Course(name, credits);
}
#+END_SRC

Run my tests: they pass.  Woo!

* Step 2: Generalize that to find (failure)

Moving down the file, let's see if we can do the same thing to find.

#+BEGIN_SRC java
	public static Course find(String name) {
		Connection conn = null;
		try {
			conn = DriverManager.getConnection(url, "", "");
			Statement statement = conn.createStatement();
			ResultSet result = statement
					.executeQuery("SELECT * FROM course WHERE Name = '" + name
							+ "'");
			if (!result.next())
				return null;

			int credits = result.getInt("Credits");
			return new Course(name, credits);
		} catch (Exception ex) {
			return null;
		} finally {
			try {
				conn.close();
			} catch (Exception ignored) {
			}
		}
	}
#+END_SRC

Hmmm...unfortunately this sucker calls execute *Query* not
executeUpdate.  Maybe I could just switch my executeUpdate to
executeQuery?

I try it and run my tests.  No dice.

Ok.  I think there's something here but find is gonna be more
complicated.  Let me try instead on update -- that looks easier.

* Step 3: Generalize that to update

Update becomes

#+BEGIN_SRC java
public void update() throws Exception {
	String[] commands = { 
			"DELETE FROM COURSE WHERE name = '" + name + "'",
			"INSERT INTO course VALUES('" + name + "'," + credits + ")" 
			};
	doDBCommands(commands);
}
#+END_SRC

Sweet.  I'm now more confident I might have something here.

Poking around, I think there are some other functions that could
easily improved with my doDBCommands function, but many of them are
queries and can't be.

