Code/CoursesExampleSolution/solutionNotes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Courses In Class Refactoring Solution</title>
<!-- 2015-04-02 Thu 17:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Buffalo" />


</head>
<body>
<div id="content">
<h1 class="title">Courses In Class Refactoring Solution</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Step 1: Playing with a function</a></li>
<li><a href="#sec-2">2. Step 2: Generalize that to find (failure)</a></li>
<li><a href="#sec-3">3. Step 3: Generalize that to update</a></li>
<li><a href="#sec-4">4. Step 4: I try to write a version of doDBCommands for query (failure)</a></li>
<li><a href="#sec-5">5. Step 5: What do I do?</a></li>
<li><a href="#sec-6">6. Step 6: Extract these DB functions to a class</a></li>
<li><a href="#sec-7">7. Step 7: Make Offering Use the New Functions</a></li>
<li><a href="#sec-8">8. Step 8: Update Schedule</a></li>
<li><a href="#sec-9">9. Step 9: Make doDBQuery return multiple results</a></li>
<li><a href="#sec-10">10. Step 10: The future</a></li>
<li><a href="#sec-11">11. Many other refactorings are possible: yours may well be nicer than mine</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Step 1: Playing with a function</h2>
<div class="outline-text-2" id="text-1">
<p>
I start out without any strong intuition about what I want to do,
except a feeling that there is a strong similarity between all the
functions that use a database.  There are similarity between classes
too, but I'm not 100% sure what to make of that so I decide to start
in the simplest possible way.
</p>

<p>
I look at the function Course::create and decide to pull out the
database specific code, hoping that maybe I can reuse that in some of
the other functions:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">Course</span> <span style="color: #006699;">create</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>, <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">credits</span>) 
    <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">Exception</span> 
{
  <span style="color: #6434A3;">Connection</span> <span style="color: #BA36A5;">conn</span> = <span style="color: #D0372D;">null</span>;

  <span style="color: #0000FF;">try</span> {
      conn = DriverManager.getConnection(url, <span style="color: #008000;">""</span>, <span style="color: #008000;">""</span>);
      <span style="color: #6434A3;">Statement</span> <span style="color: #BA36A5;">statement</span> = conn.createStatement();
      statement.executeUpdate(
        <span style="color: #008000;">"DELETE FROM course WHERE name = '"</span> + name + <span style="color: #008000;">"'"</span>);
      statement.executeUpdate(
        <span style="color: #008000;">"INSERT INTO course VALUES ('"</span> + name 
        + <span style="color: #008000;">"', "</span> + credits + <span style="color: #008000;">")"</span>);
      <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Course</span>(name, credits);
  } <span style="color: #0000FF;">finally</span> {
      <span style="color: #0000FF;">try</span> { conn.close(); } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">ignored</span>) {}
  }
}
</pre>
</div>

<p>
It takes me a minute to figure out what I want to do with the 2
different SQL commands.  I decide on making my new function take an
array of Strings.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">doDBCommands</span>(<span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">commands</span>) <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">Exception</span> {
        <span style="color: #6434A3;">Connection</span> <span style="color: #BA36A5;">conn</span> = <span style="color: #D0372D;">null</span>;

        <span style="color: #0000FF;">try</span> {
                conn = DriverManager.getConnection(url, <span style="color: #008000;">""</span>, <span style="color: #008000;">""</span>);
                <span style="color: #6434A3;">Statement</span> <span style="color: #BA36A5;">statement</span> = conn.createStatement();
                <span style="color: #0000FF;">for</span> (<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">command</span> : commands) {
                        statement.executeUpdate(command);
                }
        } <span style="color: #0000FF;">finally</span> {
                <span style="color: #0000FF;">try</span> {
                        conn.close();
                } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">ignored</span>) {
                }
        }
}

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">Course</span> <span style="color: #006699;">create</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>, <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">credits</span>) <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">Exception</span> {

        <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">commands</span> = { 
                        <span style="color: #008000;">"DELETE FROM course WHERE name = '"</span> + name + <span style="color: #008000;">"'"</span>,
                        <span style="color: #008000;">"INSERT INTO course VALUES ('"</span> + name + <span style="color: #008000;">"', "</span> + credits + <span style="color: #008000;">")"</span> 
                        };
        doDBCommands(commands);
        <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Course</span>(name, credits);
}
</pre>
</div>

<p>
Run my tests: they pass.  Woo!
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Step 2: Generalize that to find (failure)</h2>
<div class="outline-text-2" id="text-2">
<p>
Moving down the file, let's see if we can do the same thing to find.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">Course</span> <span style="color: #006699;">find</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>) {
        <span style="color: #6434A3;">Connection</span> <span style="color: #BA36A5;">conn</span> = <span style="color: #D0372D;">null</span>;
        <span style="color: #0000FF;">try</span> {
                conn = DriverManager.getConnection(url, <span style="color: #008000;">""</span>, <span style="color: #008000;">""</span>);
                <span style="color: #6434A3;">Statement</span> <span style="color: #BA36A5;">statement</span> = conn.createStatement();
                <span style="color: #6434A3;">ResultSet</span> <span style="color: #BA36A5;">result</span> = statement
                                .executeQuery(<span style="color: #008000;">"SELECT * FROM course WHERE Name = '"</span> + name
                                                + <span style="color: #008000;">"'"</span>);
                <span style="color: #0000FF;">if</span> (<span style="color: #F0DFAF; font-weight: bold;">!</span>result.next())
                        <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">null</span>;

                <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">credits</span> = result.getInt(<span style="color: #008000;">"Credits"</span>);
                <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Course</span>(name, credits);
        } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">ex</span>) {
                <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">null</span>;
        } <span style="color: #0000FF;">finally</span> {
                <span style="color: #0000FF;">try</span> {
                        conn.close();
                } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">ignored</span>) {
                }
        }
}
</pre>
</div>

<p>
Hmmm&#x2026;unfortunately this sucker calls execute <b>Query</b> not
executeUpdate.  Maybe I could just switch my executeUpdate to
executeQuery?
</p>

<p>
I try it and run my tests.  No dice.
</p>

<p>
Ok.  I think there's something here but find is gonna be more
complicated.  Let me try instead on update &#x2013; that looks easier.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Step 3: Generalize that to update</h2>
<div class="outline-text-2" id="text-3">
<p>
Update becomes
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">update</span>() <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">Exception</span> {
        <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">commands</span> = { 
                        <span style="color: #008000;">"DELETE FROM COURSE WHERE name = '"</span> + name + <span style="color: #008000;">"'"</span>,
                        <span style="color: #008000;">"INSERT INTO course VALUES('"</span> + name + <span style="color: #008000;">"',"</span> + credits + <span style="color: #008000;">")"</span> 
                        };
        doDBCommands(commands);
}
</pre>
</div>

<p>
Sweet.  I'm now more confident I might have something here.
</p>

<p>
Poking around, I think there are some other functions that could
easily improved with my doDBCommands function, but many of them are
queries and can't be.
</p>
</div>
</div>
