Code/CoursesExampleSolution/solutionNotes.org
* Step 4: I try to write a version of doDBCommands for query (failure)

I change the code to look like this:

#+BEGIN_SRC java
public static ResultSet doDBQuery(String querySQL) {
	Connection conn = null;
	try {
		conn = DriverManager.getConnection(url, "", "");
		Statement statement = conn.createStatement();
		ResultSet result = statement
				.executeQuery(querySQL);

		return result;
	} catch (Exception ex) {
		return null;
	} finally {
		try {
			conn.close();
		} catch (Exception ignored) {
		}
	}
}

public static Course find(String name) {
	ResultSet result = doDBQuery("SELECT * FROM course WHERE Name = '"
			+ name + "'");
	try {
		if (!result.next())
			return null;

		int credits = result.getInt("Credits");
		return new Course(name, credits);
	} catch (SQLException ignored) {
		return null;
	}
}
#+END_SRC

I'm not fully happy with it, especially after I run my tests and they
fail.  NullPointerException?  Oh, maybe I should not be stupidly
swallowing the results of exceptions and returning null, huh?

But my goal is to refactor - not change this code's error handling.
Still adding a print statement to figure out what's up would aid my
debugging.

I toss a ignored.printStackTrace into find.

: java.sql.SQLException: ResultSet not open. Operation 'next' not permitted. Verify that autocommit is OFF.

Hmmm...I figure out that this is because I'm calling a function on a
resultSet after the connection is closed.  Uh oh.

* Step 5: What do I do?

Ok, so I can't use a ResultSet as my result.  But it looks like what
is coming back is very simple - maybe I could use some other data
structure?

Hmmmm...in this case the query returns an int.  What other options are
there?  Looking around I see both ints and Strings, with some queries
needing to get more than one value.  Also in each cause I need to get
specific fields.

I propose - I'll pass a list of strings, and return a list of strings
(that can be converted into an int).

I also rework the ways exceptions get thrown so that errors or passed
to find as exceptions to find, which then returns null (preserving the
existing behavior).

#+BEGIN_SRC java
public static String[] doDBQuery(String querySQL, String[] columns) throws SQLException {
	Connection conn = null;
	try {
		conn = DriverManager.getConnection(url, "", "");
		Statement statement = conn.createStatement();
		ResultSet row = statement
				.executeQuery(querySQL);
		if(!row.next())
			throw new SQLException("No rows returned!");
		String[] results = new String[columns.length];
		for(int i = 0; i < results.length; i++) {
			results[i] = row.getString(columns[i]);
		}
		return results;
	} finally {
		try {
			conn.close();
		} catch (Exception ignored) {
		}
	}
}

public static Course find(String name) {
	try {
		String[] results = doDBQuery("SELECT * FROM course WHERE Name = '"
			+ name + "'", new String[] {"Credits"});
		return new Course(name, Integer.parseInt(results[0]));
	} catch (SQLException ignored) {
		return null;
	}
}
#+END_SRC

