Code/CoursesExampleSolution/solutionNotes.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Step 4: I try to write a version of doDBCommands for query (failure)</h2>
<div class="outline-text-2" id="text-4">
<p>
I change the code to look like this:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">ResultSet</span> <span style="color: #006699;">doDBQuery</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">querySQL</span>) {
        <span style="color: #6434A3;">Connection</span> <span style="color: #BA36A5;">conn</span> = <span style="color: #D0372D;">null</span>;
        <span style="color: #0000FF;">try</span> {
                conn = DriverManager.getConnection(url, <span style="color: #008000;">""</span>, <span style="color: #008000;">""</span>);
                <span style="color: #6434A3;">Statement</span> <span style="color: #BA36A5;">statement</span> = conn.createStatement();
                <span style="color: #6434A3;">ResultSet</span> <span style="color: #BA36A5;">result</span> = statement
                                .executeQuery(querySQL);

                <span style="color: #0000FF;">return</span> result;
        } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">ex</span>) {
                <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">null</span>;
        } <span style="color: #0000FF;">finally</span> {
                <span style="color: #0000FF;">try</span> {
                        conn.close();
                } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">ignored</span>) {
                }
        }
}

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">Course</span> <span style="color: #006699;">find</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>) {
        <span style="color: #6434A3;">ResultSet</span> <span style="color: #BA36A5;">result</span> = doDBQuery(<span style="color: #008000;">"SELECT * FROM course WHERE Name = '"</span>
                        + name + <span style="color: #008000;">"'"</span>);
        <span style="color: #0000FF;">try</span> {
                <span style="color: #0000FF;">if</span> (<span style="color: #F0DFAF; font-weight: bold;">!</span>result.next())
                        <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">null</span>;

                <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">credits</span> = result.getInt(<span style="color: #008000;">"Credits"</span>);
                <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Course</span>(name, credits);
        } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">SQLException</span> <span style="color: #BA36A5;">ignored</span>) {
                <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">null</span>;
        }
}
</pre>
</div>

<p>
I'm not fully happy with it, especially after I run my tests and they
fail.  NullPointerException?  Oh, maybe I should not be stupidly
swallowing the results of exceptions and returning null, huh?
</p>

<p>
But my goal is to refactor - not change this code's error handling.
Still adding a print statement to figure out what's up would aid my
debugging.
</p>

<p>
I toss a ignored.printStackTrace into find.
</p>

<pre class="example">
java.sql.SQLException: ResultSet not open. Operation 'next' not permitted. Verify that autocommit is OFF.
</pre>

<p>
Hmmm&#x2026;I figure out that this is because I'm calling a function on a
resultSet after the connection is closed.  Uh oh.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Step 5: What do I do?</h2>
<div class="outline-text-2" id="text-5">
<p>
Ok, so I can't use a ResultSet as my result.  But it looks like what
is coming back is very simple - maybe I could use some other data
structure?
</p>

<p>
Hmmmm&#x2026;in this case the query returns an int.  What other options are
there?  Looking around I see both ints and Strings, with some queries
needing to get more than one value.  Also in each cause I need to get
specific fields.
</p>

<p>
I propose - I'll pass a list of strings, and return a list of strings
(that can be converted into an int).
</p>

<p>
I also rework the ways exceptions get thrown so that errors or passed
to find as exceptions to find, which then returns null (preserving the
existing behavior).
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">String</span>[] <span style="color: #006699;">doDBQuery</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">querySQL</span>, <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">columns</span>) <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">SQLException</span> {
        <span style="color: #6434A3;">Connection</span> <span style="color: #BA36A5;">conn</span> = <span style="color: #D0372D;">null</span>;
        <span style="color: #0000FF;">try</span> {
                conn = DriverManager.getConnection(url, <span style="color: #008000;">""</span>, <span style="color: #008000;">""</span>);
                <span style="color: #6434A3;">Statement</span> <span style="color: #BA36A5;">statement</span> = conn.createStatement();
                <span style="color: #6434A3;">ResultSet</span> <span style="color: #BA36A5;">row</span> = statement
                                .executeQuery(querySQL);
                <span style="color: #0000FF;">if</span>(<span style="color: #F0DFAF; font-weight: bold;">!</span>row.next())
                        <span style="color: #0000FF;">throw</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">SQLException</span>(<span style="color: #008000;">"No rows returned!"</span>);
                <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">results</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">String</span>[columns.length];
                <span style="color: #0000FF;">for</span>(<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; results.<span style="color: #6434A3;">length</span>; i++) {
                        results[i] = row.getString(columns[i]);
                }
                <span style="color: #0000FF;">return</span> results;
        } <span style="color: #0000FF;">finally</span> {
                <span style="color: #0000FF;">try</span> {
                        conn.close();
                } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">ignored</span>) {
                }
        }
}

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">Course</span> <span style="color: #006699;">find</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>) {
        <span style="color: #0000FF;">try</span> {
                <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">results</span> = doDBQuery(<span style="color: #008000;">"SELECT * FROM course WHERE Name = '"</span>
                        + name + <span style="color: #008000;">"'"</span>, <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">String</span>[] {<span style="color: #008000;">"Credits"</span>});
                <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Course</span>(name, Integer.parseInt(results[0]));
        } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">SQLException</span> <span style="color: #BA36A5;">ignored</span>) {
                <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">null</span>;
        }
}
</pre>
</div>
</div>
</div>
