Code/CoursesExampleSolution/solutionNotes.org
* Step 6: Extract these DB functions to a class

At this point Course is working reasonably nicely.  But it has crazy
static DB functions.  Let's pull thing out to their own class.

I do a bit of renaming as well.

#+BEGIN_SRC java
public class DBCommands {
	static String url = "jdbc:derby:courses";

	static {
		try {
			Class.forName("org.apache.derby.jdbc.EmbeddedDriver");
		} catch (Exception ignored) {
		}
	}

	public static void doDBUpdate(String[] commands) throws SQLException {
		Connection conn = null;

		try {
			conn = DriverManager.getConnection(url, "", "");
			Statement statement = conn.createStatement();
			for (String command : commands) {
				statement.executeUpdate(command);
			}
		} finally {
			try {
				conn.close();
			} catch (Exception ignored) {
			}
		}
	}

	public static String[] doDBQuery(String querySQL, String[] columns) throws SQLException {
		Connection conn = null;
		try {
			conn = DriverManager.getConnection(url, "", "");
			Statement statement = conn.createStatement();
			ResultSet row = statement
					.executeQuery(querySQL);
			if(!row.next())
				throw new SQLException("No rows returned!");
			String[] results = new String[columns.length];
			for(int i = 0; i < results.length; i++) {
				results[i] = row.getString(columns[i]);
			}
			return results;
		} finally {
			try {
				conn.close();
			} catch (Exception ignored) {
			}
		}
	}
}
#+END_SRC

* Step 7: Make Offering Use the New Functions

I test as a replace each function.

Update and find both are easy fixes.  Max id needs another query:

#+BEGIN_SRC java
public static int getMaxOfferingId() throws SQLException 
{
    Connection conn = null;

    try {
        conn = DriverManager.getConnection(url, "", "");
        Statement statement = conn.createStatement();

        ResultSet result = statement.executeQuery("SELECT MAX(ID) FROM offering");
        result.next();
        return result.getInt(1);

    } finally {
        try { conn.close(); } catch (Exception ignored) {}
    }
}
#+END_SRC

Inserted a bug with my change to max id - discovered it with tests and
quickly fixed it.

New version of offering:
#+BEGIN_SRC java
public class Offering {
    private int id;
    private Course course;
    private String daysTimes;

    public static Offering create(Course course, String daysTimesCsv) 
        throws SQLException 
    {
    	int newId = DBCommands.getMaxOfferingId() + 1;
		String[] commands = { 
				"INSERT INTO offering VALUES ("
	                    + newId + ",'" + course.getName() 
	                    + "','" + daysTimesCsv + "')"
				};
		DBCommands.doDBUpdate(commands);
		return new Offering(newId, course, daysTimesCsv);
    }

    public static Offering find(int id) {
    	try {
    		String[] results = DBCommands.doDBQuery("SELECT * FROM offering WHERE ID =" + id, 
    				new String[] {"Course","DateTime"});
    		String courseName = results[0]; 
    		Course course = Course.find(courseName); 
    		String dateTime = results[1];
    		return new Offering(id, course, dateTime);
	} catch (SQLException ignored) {
		return null;
	}
    }

    public void update() throws SQLException{
		String[] commands = { 
				"DELETE FROM Offering WHERE ID=" + id,
				"INSERT INTO Offering VALUES(" + id + ",'" +
	                      course.getName() + "','" + daysTimes + "')"
				};
		DBCommands.doDBUpdate(commands);
    }

// everything else is unchanged
#+END_SRC

