Code/CoursesExampleSolution/solutionNotes.html

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Step 6: Extract these DB functions to a class</h2>
<div class="outline-text-2" id="text-6">
<p>
At this point Course is working reasonably nicely.  But it has crazy
static DB functions.  Let's pull thing out to their own class.
</p>

<p>
I do a bit of renaming as well.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">DBCommands</span> {
        <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">url</span> = <span style="color: #008000;">"jdbc:derby:courses"</span>;

        <span style="color: #0000FF;">static</span> {
                <span style="color: #0000FF;">try</span> {
                        Class.forName(<span style="color: #008000;">"org.apache.derby.jdbc.EmbeddedDriver"</span>);
                } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">ignored</span>) {
                }
        }

        <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">doDBUpdate</span>(<span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">commands</span>) <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">SQLException</span> {
                <span style="color: #6434A3;">Connection</span> <span style="color: #BA36A5;">conn</span> = <span style="color: #D0372D;">null</span>;

                <span style="color: #0000FF;">try</span> {
                        conn = DriverManager.getConnection(url, <span style="color: #008000;">""</span>, <span style="color: #008000;">""</span>);
                        <span style="color: #6434A3;">Statement</span> <span style="color: #BA36A5;">statement</span> = conn.createStatement();
                        <span style="color: #0000FF;">for</span> (<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">command</span> : commands) {
                                statement.executeUpdate(command);
                        }
                } <span style="color: #0000FF;">finally</span> {
                        <span style="color: #0000FF;">try</span> {
                                conn.close();
                        } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">ignored</span>) {
                        }
                }
        }

        <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">String</span>[] <span style="color: #006699;">doDBQuery</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">querySQL</span>, <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">columns</span>) <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">SQLException</span> {
                <span style="color: #6434A3;">Connection</span> <span style="color: #BA36A5;">conn</span> = <span style="color: #D0372D;">null</span>;
                <span style="color: #0000FF;">try</span> {
                        conn = DriverManager.getConnection(url, <span style="color: #008000;">""</span>, <span style="color: #008000;">""</span>);
                        <span style="color: #6434A3;">Statement</span> <span style="color: #BA36A5;">statement</span> = conn.createStatement();
                        <span style="color: #6434A3;">ResultSet</span> <span style="color: #BA36A5;">row</span> = statement
                                        .executeQuery(querySQL);
                        <span style="color: #0000FF;">if</span>(<span style="color: #F0DFAF; font-weight: bold;">!</span>row.next())
                                <span style="color: #0000FF;">throw</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">SQLException</span>(<span style="color: #008000;">"No rows returned!"</span>);
                        <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">results</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">String</span>[columns.length];
                        <span style="color: #0000FF;">for</span>(<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; results.<span style="color: #6434A3;">length</span>; i++) {
                                results[i] = row.getString(columns[i]);
                        }
                        <span style="color: #0000FF;">return</span> results;
                } <span style="color: #0000FF;">finally</span> {
                        <span style="color: #0000FF;">try</span> {
                                conn.close();
                        } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">ignored</span>) {
                        }
                }
        }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Step 7: Make Offering Use the New Functions</h2>
<div class="outline-text-2" id="text-7">
<p>
I test as a replace each function.
</p>

<p>
Update and find both are easy fixes.  Max id needs another query:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">int</span> <span style="color: #006699;">getMaxOfferingId</span>() <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">SQLException</span> 
{
    <span style="color: #6434A3;">Connection</span> <span style="color: #BA36A5;">conn</span> = <span style="color: #D0372D;">null</span>;

    <span style="color: #0000FF;">try</span> {
        conn = DriverManager.getConnection(url, <span style="color: #008000;">""</span>, <span style="color: #008000;">""</span>);
        <span style="color: #6434A3;">Statement</span> <span style="color: #BA36A5;">statement</span> = conn.createStatement();

        <span style="color: #6434A3;">ResultSet</span> <span style="color: #BA36A5;">result</span> = statement.executeQuery(<span style="color: #008000;">"SELECT MAX(ID) FROM offering"</span>);
        result.next();
        <span style="color: #0000FF;">return</span> result.getInt(1);

    } <span style="color: #0000FF;">finally</span> {
        <span style="color: #0000FF;">try</span> { conn.close(); } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">ignored</span>) {}
    }
}
</pre>
</div>

<p>
Inserted a bug with my change to max id - discovered it with tests and
quickly fixed it.
</p>

<p>
New version of offering:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Offering</span> {
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">id</span>;
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">Course</span> <span style="color: #BA36A5;">course</span>;
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">daysTimes</span>;

    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">Offering</span> <span style="color: #006699;">create</span>(<span style="color: #6434A3;">Course</span> <span style="color: #BA36A5;">course</span>, <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">daysTimesCsv</span>) 
        <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">SQLException</span> 
    {
        <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">newId</span> = DBCommands.getMaxOfferingId() + 1;
                <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">commands</span> = { 
                                <span style="color: #008000;">"INSERT INTO offering VALUES ("</span>
                            + newId + <span style="color: #008000;">",'"</span> + course.getName() 
                            + <span style="color: #008000;">"','"</span> + daysTimesCsv + <span style="color: #008000;">"')"</span>
                                };
                DBCommands.doDBUpdate(commands);
                <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Offering</span>(newId, course, daysTimesCsv);
    }

    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">Offering</span> <span style="color: #006699;">find</span>(<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">id</span>) {
        <span style="color: #0000FF;">try</span> {
                <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">results</span> = DBCommands.doDBQuery(<span style="color: #008000;">"SELECT * FROM offering WHERE ID ="</span> + id, 
                                <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">String</span>[] {<span style="color: #008000;">"Course"</span>,<span style="color: #008000;">"DateTime"</span>});
                <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">courseName</span> = results[0]; 
                <span style="color: #6434A3;">Course</span> <span style="color: #BA36A5;">course</span> = Course.find(courseName); 
                <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">dateTime</span> = results[1];
                <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Offering</span>(id, course, dateTime);
        } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">SQLException</span> <span style="color: #BA36A5;">ignored</span>) {
                <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">null</span>;
        }
    }

    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">update</span>() <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">SQLException</span>{
                <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">commands</span> = { 
                                <span style="color: #008000;">"DELETE FROM Offering WHERE ID="</span> + id,
                                <span style="color: #008000;">"INSERT INTO Offering VALUES("</span> + id + <span style="color: #008000;">",'"</span> +
                              course.getName() + <span style="color: #008000;">"','"</span> + daysTimes + <span style="color: #008000;">"')"</span>
                                };
                DBCommands.doDBUpdate(commands);
    }

<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">everything else is unchanged</span>
</pre>
</div>
</div>
</div>
