Code/CoursesExampleSolution/solutionNotes.org
* Step 8: Update Schedule

I notice there a several places where I only need to a 1 line update.
I make a new version of doDBUpdate that takes just a string.

#+BEGIN_SRC java
public static void doDBUpdate(String command) throws SQLException {
	doDBUpdate(new String[] {command});
}
#+END_SRC

I change Offering to use the new method.

I update deleteAll and create.

Then I discover that Schedule::find and Schedule:all both have queries
that iterate over several rows.

* Step 9: Make doDBQuery return multiple results

...and make a new DBQueryRow that all existing uses will use.  I write
this and then run tests:

#+BEGIN_SRC java
	public static String[] doDBQueryRow(String querySQL, String[] columns) throws SQLException {
		List<String[]> results = doDBQuery(querySQL,columns);
		if(results.size() != 1) {
			throw new SQLException("Expected 1 row.  Got " + results.size());
		}
		return results.get(0);
	}
	
	public static List<String[]> doDBQuery(String querySQL, String[] columns) throws SQLException {
		Connection conn = null;
		try {
			conn = DriverManager.getConnection(url, "", "");
			Statement statement = conn.createStatement();
			ResultSet rows = statement
					.executeQuery(querySQL);
			List<String[]> results = new LinkedList<String[]>();
			while(rows.next()) {
				String[] rowResult = new String[columns.length];
				for(int i = 0; i < rowResult.length; i++) {
					rowResult[i] = rows.getString(columns[i]);
				}
				results.add(rowResult);
			}
			return results;
		} finally {
			try {
				conn.close();
			} catch (Exception ignored) {
			}
		}
	}
#+END_SRC

Then I updated schedule (this took a little careful work):
#+BEGIN_SRC java
public static void deleteAll() throws SQLException {
	DBCommands.doDBUpdate("DELETE FROM schedule");
}

public static Schedule create(String name) throws SQLException {

	DBCommands.doDBUpdate("DELETE FROM schedule WHERE name = '" + name
			+ "'");
	return new Schedule(name);
}

public static Schedule find(String name) {
	try {
		String[] rowNames = { "OfferingId" };
		String sql = "SELECT * FROM schedule WHERE Name= '" + name + "'";

		Schedule schedule = new Schedule(name);

		for (String[] row : DBCommands.doDBQuery(sql, rowNames)) {
			int offeringId = Integer.parseInt(row[0]);
			Offering offering = Offering.find(offeringId);
			schedule.add(offering);
		}
		return schedule;
	} catch (SQLException ex) {
		return null;
	}

}

public static Collection<Schedule> all() throws SQLException {
	String[] rowNames = { "Name" };
	String sql = "SELECT DISTINCT Name FROM schedule";
	ArrayList<Schedule> result = new ArrayList<Schedule>();

	for (String[] row : DBCommands.doDBQuery(sql, rowNames)) {
		result.add(Schedule.find(row[0]));

	}

	return result;
}

public void update() throws SQLException {

	String[] commands = new String[schedule.size() + 1];
	commands[0] = "DELETE FROM schedule WHERE name = '" + name + "'";

	for (int i = 0; i < schedule.size(); i++) {
		Offering offering = (Offering) schedule.get(i);
		commands[i + 1] = "INSERT INTO schedule VALUES('" + name + "',"
				+ offering.getId() + ")";
	}
	DBCommands.doDBUpdate(commands);
}
#+END_SRC

* Step 10: The future

Overall, I am unhappy with the result of this refactoring.  Seems like
what's really going on here is we want to have a closure or
closure-like thing that lets me replace the internals of the functions
while allow freedom to make statements and use resultset object
freely.

Exactly how that's implemented is tricky - maybe some superclass with
a template method and anonymous inner classes, maybe something with
the new Java closures...needs a little more research but I think that
complexity is worth it given the code here.

But I did learn a lot doing this refactoring and now I'm positioned to
understand the design clearly and how to fix it better - so overall I
consider the refactoring worth it BECAUSE of what it taught me about
the code and the design ideas it provided to the future (hopefully
final design.

