Code/CoursesExampleSolution/solutionNotes.html

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Step 8: Update Schedule</h2>
<div class="outline-text-2" id="text-8">
<p>
I notice there a several places where I only need to a 1 line update.
I make a new version of doDBUpdate that takes just a string.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">doDBUpdate</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">command</span>) <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">SQLException</span> {
        doDBUpdate(<span style="color: #0000FF;">new</span> <span style="color: #6434A3;">String</span>[] {command});
}
</pre>
</div>

<p>
I change Offering to use the new method.
</p>

<p>
I update deleteAll and create.
</p>

<p>
Then I discover that Schedule::find and Schedule:all both have queries
that iterate over several rows.
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Step 9: Make doDBQuery return multiple results</h2>
<div class="outline-text-2" id="text-9">
<p>
&#x2026;and make a new DBQueryRow that all existing uses will use.  I write
this and then run tests:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">String</span>[] <span style="color: #006699;">doDBQueryRow</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">querySQL</span>, <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">columns</span>) <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">SQLException</span> {
        <span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">String</span>[]&gt; <span style="color: #BA36A5;">results</span> = doDBQuery(querySQL,columns);
        <span style="color: #0000FF;">if</span>(results.size() != 1) {
                <span style="color: #0000FF;">throw</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">SQLException</span>(<span style="color: #008000;">"Expected 1 row.  Got "</span> + results.size());
        }
        <span style="color: #0000FF;">return</span> results.get(0);
}

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">String</span>[]&gt; <span style="color: #006699;">doDBQuery</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">querySQL</span>, <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">columns</span>) <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">SQLException</span> {
        <span style="color: #6434A3;">Connection</span> <span style="color: #BA36A5;">conn</span> = <span style="color: #D0372D;">null</span>;
        <span style="color: #0000FF;">try</span> {
                conn = DriverManager.getConnection(url, <span style="color: #008000;">""</span>, <span style="color: #008000;">""</span>);
                <span style="color: #6434A3;">Statement</span> <span style="color: #BA36A5;">statement</span> = conn.createStatement();
                <span style="color: #6434A3;">ResultSet</span> <span style="color: #BA36A5;">rows</span> = statement
                                .executeQuery(querySQL);
                <span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">String</span>[]&gt; <span style="color: #BA36A5;">results</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">LinkedList</span>&lt;<span style="color: #6434A3;">String</span>[]&gt;();
                <span style="color: #0000FF;">while</span>(rows.next()) {
                        <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">rowResult</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">String</span>[columns.length];
                        <span style="color: #0000FF;">for</span>(<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; rowResult.<span style="color: #6434A3;">length</span>; i++) {
                                rowResult[i] = rows.getString(columns[i]);
                        }
                        results.add(rowResult);
                }
                <span style="color: #0000FF;">return</span> results;
        } <span style="color: #0000FF;">finally</span> {
                <span style="color: #0000FF;">try</span> {
                        conn.close();
                } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">ignored</span>) {
                }
        }
}
</pre>
</div>

<p>
Then I updated schedule (this took a little careful work):
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">deleteAll</span>() <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">SQLException</span> {
        DBCommands.doDBUpdate(<span style="color: #008000;">"DELETE FROM schedule"</span>);
}

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">Schedule</span> <span style="color: #006699;">create</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>) <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">SQLException</span> {

        DBCommands.doDBUpdate(<span style="color: #008000;">"DELETE FROM schedule WHERE name = '"</span> + name
                        + <span style="color: #008000;">"'"</span>);
        <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Schedule</span>(name);
}

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">Schedule</span> <span style="color: #006699;">find</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>) {
        <span style="color: #0000FF;">try</span> {
                <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">rowNames</span> = { <span style="color: #008000;">"OfferingId"</span> };
                <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">sql</span> = <span style="color: #008000;">"SELECT * FROM schedule WHERE Name= '"</span> + name + <span style="color: #008000;">"'"</span>;

                <span style="color: #6434A3;">Schedule</span> <span style="color: #BA36A5;">schedule</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Schedule</span>(name);

                <span style="color: #0000FF;">for</span> (<span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">row</span> : DBCommands.doDBQuery(sql, rowNames)) {
                        <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">offeringId</span> = Integer.parseInt(row[0]);
                        <span style="color: #6434A3;">Offering</span> <span style="color: #BA36A5;">offering</span> = Offering.find(offeringId);
                        schedule.add(offering);
                }
                <span style="color: #0000FF;">return</span> schedule;
        } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">SQLException</span> <span style="color: #BA36A5;">ex</span>) {
                <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">null</span>;
        }

}

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">Collection</span>&lt;<span style="color: #6434A3;">Schedule</span>&gt; <span style="color: #006699;">all</span>() <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">SQLException</span> {
        <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">rowNames</span> = { <span style="color: #008000;">"Name"</span> };
        <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">sql</span> = <span style="color: #008000;">"SELECT DISTINCT Name FROM schedule"</span>;
        <span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">Schedule</span>&gt; <span style="color: #BA36A5;">result</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">Schedule</span>&gt;();

        <span style="color: #0000FF;">for</span> (<span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">row</span> : DBCommands.doDBQuery(sql, rowNames)) {
                result.add(Schedule.find(row[0]));

        }

        <span style="color: #0000FF;">return</span> result;
}

<span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">update</span>() <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">SQLException</span> {

        <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">commands</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">String</span>[schedule.size() + 1];
        commands[0] = <span style="color: #008000;">"DELETE FROM schedule WHERE name = '"</span> + name + <span style="color: #008000;">"'"</span>;

        <span style="color: #0000FF;">for</span> (<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; schedule.<span style="color: #6434A3;">size</span>(); i++) {
                <span style="color: #6434A3;">Offering</span> <span style="color: #BA36A5;">offering</span> = (<span style="color: #6434A3;">Offering</span>) schedule.get(i);
                commands[i + 1] = <span style="color: #008000;">"INSERT INTO schedule VALUES('"</span> + name + <span style="color: #008000;">"',"</span>
                                + offering.getId() + <span style="color: #008000;">")"</span>;
        }
        DBCommands.doDBUpdate(commands);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Step 10: The future</h2>
<div class="outline-text-2" id="text-10">
<p>
Overall, I am unhappy with the result of this refactoring.  Seems like
what's really going on here is we want to have a closure or
closure-like thing that lets me replace the internals of the functions
while allow freedom to make statements and use resultset object
freely.
</p>

<p>
Exactly how that's implemented is tricky - maybe some superclass with
a template method and anonymous inner classes, maybe something with
the new Java closures&#x2026;needs a little more research but I think that
complexity is worth it given the code here.
</p>

<p>
But I did learn a lot doing this refactoring and now I'm positioned to
understand the design clearly and how to fix it better - so overall I
consider the refactoring worth it BECAUSE of what it taught me about
the code and the design ideas it provided to the future (hopefully
final design.
</p>
</div>
</div>
